nxp-mcuxpresso/sbl/target/evkmimxrt600/device/MIMXRT685S/drivers/fsl_i3c.h
/*! @brief I3C slave.activity state */
typedef enum _i3c_slave_activity_state
{
    kI3C_SlaveNoLatency    = 0U, /*!< Normal bus operation */
    kI3C_SlaveLatency1Ms   = 1U, /*!< 1ms of latency. */
    kI3C_SlaveLatency100Ms = 2U, /*!< 100ms of latency. */
    kI3C_SlaveLatency10S   = 3U, /*!< 10s latency. */
} i3c_slave_activity_state_t;

/*!
 * @brief Structure with settings to initialize the I3C slave module.
 *
 * This structure holds configuration settings for the I3C peripheral. To initialize this
 * structure to reasonable defaults, call the I3C_SlaveGetDefaultConfig() function and
 * pass a pointer to your configuration structure instance.
 *
 * The configuration structure can be made constant so it resides in flash.
 */
typedef struct _i3c_slave_config
{
    bool enableSlave;      /*!< Whether to enable slave. */
    uint8_t staticAddr;    /*!< Static address. */
    uint16_t vendorID;     /*!< Device vendor ID(manufacture ID). */
    bool enableRandomPart; /*!< Whether to generate random part number, if using random part number,
                                the partNumber variable setting is meaningless. */
    uint32_t partNumber;   /*!< Device part number info */
    uint8_t dcr;           /*!< Device characteristics register information. */
    uint8_t bcr;           /*!< Bus characteristics register information. */
    uint8_t hdrMode;       /*!< Support hdr mode, could be OR logic in enumeration:i3c_hdr_mode_t. */
    bool nakAllRequest;    /*!< Whether to reply NAK to all requests except broadcast CCC. */
    bool ignoreS0S1Error;  /*!< Whether to ignore S0/S1 error in SDR mode. */
    bool offline; /*!< Whether to wait 60 us of bus quiet or HDR request to ensure slave track SDR mode safely. */
    bool matchSlaveStartStop; /*!< Whether to assert start/stop status only the time slave is addressed. */
} i3c_slave_config_t;

/*!
 * @brief Set of events sent to the callback for non blocking slave transfers.
 *
 * These event enumerations are used for two related purposes. First, a bit mask created by OR'ing together
 * events is passed to I3C_SlaveTransferNonBlocking() in order to specify which events to enable.
 * Then, when the slave callback is invoked, it is passed the current event through its @a transfer
 * parameter.
 *
 * @note These enumerations are meant to be OR'd together to form a bit mask of events.
 */
typedef enum _i3c_slave_transfer_event
{
    kI3C_SlaveAddressMatchEvent = 0x01U,     /*!< Received the slave address after a start or repeated start. */
    kI3C_SlaveTransmitEvent     = 0x02U,     /*!< Callback is requested to provide data to transmit
                                                    (slave-transmitter role). */
    kI3C_SlaveReceiveEvent = 0x04U,          /*!< Callback is requested to provide a buffer in which to place received
                                                     data (slave-receiver role). */
    kI3C_SlaveRequiredTransmitEvent = 0x08U, /*!< Callback is requested to provide a buffer in which to place received
                                               data (slave-receiver role). */
    kI3C_SlaveStartEvent           = 0x10U,  /*!< A start/repeated start was detected. */
    kI3C_SlaveHDRCommandMatchEvent = 0x20U,  /*!< Slave Match HDR Command. */
    kI3C_SlaveCompletionEvent      = 0x40U,  /*!< A stop was detected, completing the transfer. */

    /*! Bit mask of all available events. */
    kI3C_SlaveAllEvents = kI3C_SlaveAddressMatchEvent | kI3C_SlaveTransmitEvent | kI3C_SlaveReceiveEvent |
                          kI3C_SlaveStartEvent | kI3C_SlaveHDRCommandMatchEvent | kI3C_SlaveCompletionEvent,
} i3c_slave_transfer_event_t;

/*! @brief I3C slave transfer structure */
typedef struct _i3c_slave_transfer
{
    uint32_t event;            /*!< Reason the callback is being invoked. */
    uint8_t *txData;           /*!< Transfer buffer */
    size_t txDataSize;         /*!< Transfer size */
    uint8_t *rxData;           /*!< Transfer buffer */
    size_t rxDataSize;         /*!< Transfer size */
    status_t completionStatus; /*!< Success or error code describing how the transfer completed. Only applies for
                                  #kI3C_SlaveCompletionEvent. */
    size_t transferredCount;   /*!< Number of bytes actually transferred since start or last repeated start. */
} i3c_slave_transfer_t;

/* Forward declaration. */
typedef struct _i3c_slave_handle i3c_slave_handle_t;

/*!
 * @brief Slave event callback function pointer type.
 *
 * This callback is used only for the slave non-blocking transfer API. To install a callback,
 * use the I3C_SlaveSetCallback() function after you have created a handle.
 *
 * @param base Base address for the I3C instance on which the event occurred.
 * @param transfer Pointer to transfer descriptor containing values passed to and/or from the callback.
 * @param userData Arbitrary pointer-sized value passed from the application.
 */
typedef void (*i3c_slave_transfer_callback_t)(I3C_Type *base, i3c_slave_transfer_t *transfer, void *userData);

/*!
 * @brief I3C slave handle structure.
 * @note The contents of this structure are private and subject to change.
 */
struct _i3c_slave_handle
{
    i3c_slave_transfer_t transfer;          /*!< I3C slave transfer copy. */
    bool isBusy;                            /*!< Whether transfer is busy. */
    bool wasTransmit;                       /*!< Whether the last transfer was a transmit. */
    uint32_t eventMask;                     /*!< Mask of enabled events. */
    uint32_t transferredCount;              /*!< Count of bytes transferred. */
    i3c_slave_transfer_callback_t callback; /*!< Callback function called at transfer event. */
    void *userData;                         /*!< Callback parameter passed to callback. */
};

/*! @} */
/*******************************************************************************
 * API
 ******************************************************************************/
#
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @addtogroup i3c_master_driver
 * @{
 */

